[
  {
    "image": "https://i.ibb.co.com/Y7M4jrH4/camera-408474.png",
    "title": "SnapPix",
    "companyName": "Photon Labs",
    "id": 1,
    "description": "SnapPix lets you capture stunning photos effortlessly. It offers AI-powered filters for instant enhancement. You can adjust brightness, contrast, and saturation with precision. Crop and rotate your images to perfection. Blur or sharpen backgrounds easily. Apply professional-grade effects in a single tap. Save your edits in high resolution. Organize your photos in customizable albums. Share your creations directly to social media. Collaborate with friends on shared projects. Explore trending filters curated daily. Enjoy intuitive gestures for editing. Use the undo and redo feature for perfect results. Quickly compare before-and-after images. Create collages with pre-set layouts. Access tutorials and tips within the app. Backup your edits to cloud storage. Sync across multiple devices seamlessly. Enjoy minimal ads for uninterrupted editing. SnapPix transforms everyday photos into professional-quality images.",
    "size": "45 MB",
    "reviews": 12034,
    "ratingAvg": 4.6,
    "downloads": "25M",
    "ratings": [
      {
        "name": "1 star",
        "count": 410
      },
      {
        "name": "2 star",
        "count": 520
      },
      {
        "name": "3 star",
        "count": 1340
      },
      {
        "name": "4 star",
        "count": 3650
      },
      {
        "name": "5 star",
        "count": 8114
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/N2gTMrGT/fitness-2964514.png",
    "title": "FitTrack Pro",
    "companyName": "ActiveMind",
    "id": 2,
    "description": "FitTrack Pro helps you monitor your workouts in real time. Log exercises with ease. Track calories burned accurately. Set and achieve daily fitness goals. Monitor your heart rate and steps. Sync with wearable devices seamlessly. Analyze workout trends over time. Access pre-set exercise plans. Customize routines to your needs. Track water intake and nutrition. Get reminders to stay active. Receive motivational messages and insights. Join challenges with friends for extra motivation. Track sleep patterns for recovery. View detailed charts and progress summaries. Export reports for professional trainers. Enjoy clean, intuitive design. Get tips from certified fitness experts. Stay motivated with streak tracking. FitTrack Pro makes your fitness journey simple and effective.",
    "size": "78 MB",
    "reviews": 9540,
    "ratingAvg": 4.2,
    "downloads": "7.3M",
    "ratings": [
      {
        "name": "1 star",
        "count": 640
      },
      {
        "name": "2 star",
        "count": 790
      },
      {
        "name": "3 star",
        "count": 1650
      },
      {
        "name": "4 star",
        "count": 2850
      },
      {
        "name": "5 star",
        "count": 3610
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/0pcz87Hd/sticky-note-3985004.png",
    "title": "NoteNest",
    "companyName": "ScribeTech",
    "id": 3,
    "description": "NoteNest allows you to organize thoughts effortlessly. Create unlimited notes. Tag notes for easy retrieval. Add images, links, and attachments. Secure notes with passwords or biometrics. Sync notes across devices. Use rich text formatting for clarity. Create checklists and to-do lists. Set reminders for important tasks. Collaborate with colleagues or friends. Backup your notes automatically. Search notes instantly with keywords. Archive old notes without deletion. Customize note templates. Share notes via email or messaging apps. Access your notes offline. Export notes in multiple formats. Use widgets for quick access. Organize notes by folders and colors. NoteNest makes personal and professional note-taking seamless.",
    "size": "32 MB",
    "reviews": 6740,
    "ratingAvg": 4.4,
    "downloads": "8.9M",
    "ratings": [
      {
        "name": "1 star",
        "count": 280
      },
      {
        "name": "2 star",
        "count": 390
      },
      {
        "name": "3 star",
        "count": 1120
      },
      {
        "name": "4 star",
        "count": 2110
      },
      {
        "name": "5 star",
        "count": 2840
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/twJ1Bm9M/meditation-2906496.png",
    "title": "MindEase",
    "companyName": "ZenWare",
    "id": 4,
    "description": "MindEase guides you through stress relief exercises. Access meditation sessions anytime. Choose from multiple session lengths. Focus on breathing and relaxation. Track mood and stress patterns. Set daily mindfulness reminders. Explore guided visualizations. Learn techniques to improve sleep. Enjoy soothing background sounds. Participate in challenges for mental wellness. Track meditation streaks for motivation. Access expert tips and advice. Customize session themes. Integrate with your calendar for reminders. Export progress reports. Discover new meditation tracks weekly. Use offline sessions anywhere. Adjust volume and voice guidance easily. Share achievements with friends. MindEase enhances mindfulness with simple, effective practices.",
    "size": "56 MB",
    "reviews": 15890,
    "ratingAvg": 4.8,
    "downloads": "995K",
    "ratings": [
      {
        "name": "1 star",
        "count": 310
      },
      {
        "name": "2 star",
        "count": 420
      },
      {
        "name": "3 star",
        "count": 940
      },
      {
        "name": "4 star",
        "count": 3010
      },
      {
        "name": "5 star",
        "count": 11210
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/2061bSbQ/list-2490402.png",
    "title": "TaskHunt",
    "companyName": "OrbitFlow",
    "id": 5,
    "description": "TaskHunt gamifies your productivity tasks. Create daily, weekly, or monthly goals. Track progress visually with charts. Earn rewards for completed tasks. Unlock badges as motivation. Organize tasks by priority or category. Set reminders for deadlines. Sync tasks across devices seamlessly. Collaborate with team members. Share completed tasks for recognition. Customize task layouts and themes. Use widgets for quick access. Archive old tasks automatically. Track streaks to maintain consistency. Analyze completed vs pending tasks. Backup task history. Use integrated calendar views. Receive tips for effective task management. Enjoy smooth, intuitive navigation. TaskHunt makes daily productivity fun and rewarding.",
    "size": "40 MB",
    "reviews": 8360,
    "ratingAvg": 4.3,
    "downloads": "7.2M",
    "ratings": [
      {
        "name": "1 star",
        "count": 410
      },
      {
        "name": "2 star",
        "count": 510
      },
      {
        "name": "3 star",
        "count": 1380
      },
      {
        "name": "4 star",
        "count": 2340
      },
      {
        "name": "5 star",
        "count": 3720
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/0kQQ5jy/headphones-5695034.png",
    "title": "TuneZone",
    "companyName": "MelodyWorks",
    "id": 6,
    "description": "TuneZone offers millions of songs at your fingertips. Stream music instantly. Download tracks for offline listening. Create and customize playlists. Discover curated playlists for every mood. Explore trending songs and albums. Enjoy high-quality audio streaming. Connect with friends to share music. Follow favorite artists for updates. Access personalized recommendations. Enjoy lyrics integration for sing-alongs. Control playback easily with gestures. Set sleep timers for night listening. Adjust audio settings with equalizer presets. View song details and album info. Share songs on social media. Access podcasts and live radio. Use background play while multitasking. Sync across multiple devices. TuneZone makes music discovery simple and enjoyable.",
    "size": "88 MB",
    "reviews": 28450,
    "ratingAvg": 4.5,
    "downloads": "8M",
    "ratings": [
      {
        "name": "1 star",
        "count": 1350
      },
      {
        "name": "2 star",
        "count": 1670
      },
      {
        "name": "3 star",
        "count": 3980
      },
      {
        "name": "4 star",
        "count": 7940
      },
      {
        "name": "5 star",
        "count": 13480
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ymR13T16/cooking-1027179.png",
    "title": "QuickCook",
    "companyName": "TasteLab",
    "id": 7,
    "description": "QuickCook provides easy-to-follow recipes. Search recipes by ingredients. Save favorites for quick access. Discover daily meal inspirations. Step-by-step instructions with photos. Adjust serving sizes instantly. Add personal notes to recipes. Create shopping lists automatically. Plan weekly meals effortlessly. Track nutritional information per dish. Share recipes with friends and family. Access video tutorials for complex dishes. Filter recipes by dietary needs. Set timers directly in the app. Explore international cuisines. Get tips from professional chefs. Use offline mode for convenience. Receive cooking suggestions based on inventory. Rate and review recipes. QuickCook makes cooking simple, fun, and stress-free.",
    "size": "52 MB",
    "reviews": 11340,
    "ratingAvg": 4.1,
    "downloads": "2.9M",
    "ratings": [
      {
        "name": "1 star",
        "count": 980
      },
      {
        "name": "2 star",
        "count": 1140
      },
      {
        "name": "3 star",
        "count": 1880
      },
      {
        "name": "4 star",
        "count": 2940
      },
      {
        "name": "5 star",
        "count": 4400
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qFXKgXZQ/suitcases-7571983.png",
    "title": "TripMate",
    "companyName": "GoBound",
    "id": 8,
    "description": "TripMate helps plan your travels efficiently. Explore destinations worldwide. Create detailed itineraries. Add flights, hotels, and activities. Share plans with travel companions. Get real-time weather updates. Access offline maps. Receive travel alerts and notifications. Track expenses and budgets. Discover popular local attractions. Customize trip schedules. Save memories with photo journals. Book tours and tickets directly. Join travel communities for recommendations. Get packing checklists for convenience. Sync plans across devices. Translate phrases while traveling. Access emergency contacts quickly. View trip summaries at a glance. TripMate makes travel planning organized and stress-free.",
    "size": "67 MB",
    "reviews": 15230,
    "ratingAvg": 4.7,
    "downloads": "578K",
    "ratings": [
      {
        "name": "1 star",
        "count": 380
      },
      {
        "name": "2 star",
        "count": 510
      },
      {
        "name": "3 star",
        "count": 1220
      },
      {
        "name": "4 star",
        "count": 3620
      },
      {
        "name": "5 star",
        "count": 9500
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/B2tqRxNr/linguistics-6749577.png",
    "title": "LangLoop",
    "companyName": "LingoSoft",
    "id": 9,
    "description": "LangLoop helps you learn new languages efficiently. Access lessons for beginners and advanced learners. Practice speaking with AI chat partners. Improve grammar with interactive exercises. Expand vocabulary with daily challenges. Track progress over time. Join global language communities. Receive personalized study plans. Complete quizzes to test knowledge. Listen to native pronunciations. Engage in conversation simulations. Use flashcards for memorization. Translate phrases instantly. Set study reminders. Unlock rewards for consistent practice. View detailed performance charts. Participate in language games. Access offline learning materials. Receive tips from language experts. LangLoop makes language learning structured, fun, and practical.",
    "size": "61 MB",
    "reviews": 13480,
    "ratingAvg": 4.5,
    "downloads": "400K",
    "ratings": [
      {
        "name": "1 star",
        "count": 530
      },
      {
        "name": "2 star",
        "count": 720
      },
      {
        "name": "3 star",
        "count": 1610
      },
      {
        "name": "4 star",
        "count": 3780
      },
      {
        "name": "5 star",
        "count": 6840
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/1tqtJKdy/currency-exchange-7037892.png",
    "title": "CryptoWatch",
    "companyName": "ChainPro",
    "id": 10,
    "description": "CryptoWatch monitors cryptocurrency markets in real time. Track prices for multiple coins. View historical charts and trends. Receive instant price alerts. Manage your portfolio efficiently. Set watchlists for preferred assets. Access news and updates from top sources. Analyze market performance with charts. View market cap, volume, and other metrics. Compare coins side by side. Customize dashboard layouts. Sync data across devices. Receive security tips for safe trading. Join crypto communities for insights. Discover trending tokens. Track gains and losses accurately. Export portfolio reports. Stay informed on major exchanges. CryptoWatch provides accurate and fast crypto tracking. Make informed investment decisions confidently.",
    "size": "50 MB",
    "reviews": 8450,
    "ratingAvg": 4.0,
    "downloads": "17M",
    "ratings": [
      {
        "name": "1 star",
        "count": 890
      },
      {
        "name": "2 star",
        "count": 980
      },
      {
        "name": "3 star",
        "count": 1640
      },
      {
        "name": "4 star",
        "count": 2390
      },
      {
        "name": "5 star",
        "count": 3550
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TMbSSCn2/quote-4795929.png",
    "title": "DailyQuotes",
    "companyName": "InspireMe",
    "id": 11,
    "description": "DailyQuotes delivers inspiration every day. Receive motivational messages on your device. Explore quotes by famous authors. Save favorites for easy access. Share quotes on social media. Set reminders to receive daily inspiration. Browse by category or mood. Discover new quotes weekly. Create collections of meaningful quotes. Use widgets for quick access. Access quotes offline. Customize font and background. Add personal notes to quotes. Engage with trending quotes in the community. Rate your favorite quotes. Export collections for reference. Receive tips for mindful living. Follow curated series for specific goals. Discover quotes from multiple languages. DailyQuotes turns every day into a source of motivation.",
    "size": "22 MB",
    "reviews": 4620,
    "ratingAvg": 4.6,
    "downloads": "9.2M",
    "ratings": [
      {
        "name": "1 star",
        "count": 120
      },
      {
        "name": "2 star",
        "count": 220
      },
      {
        "name": "3 star",
        "count": 520
      },
      {
        "name": "4 star",
        "count": 1180
      },
      {
        "name": "5 star",
        "count": 2580
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/tPzFLpMG/finance-438506.png",
    "title": "PocketBudget",
    "companyName": "FinEase",
    "id": 12,
    "description": "PocketBudget helps manage finances effortlessly. Track income and expenses daily. Set monthly budgets and alerts. Categorize transactions for clarity. Visualize spending with charts. Analyze savings trends over time. Track bills and recurring payments. Receive reminders for upcoming expenses. Access financial summaries anytime. Export reports for tax or review purposes. Secure your data with encryption. Sync across multiple devices. Forecast future expenses based on trends. Compare spending categories easily. Set financial goals and milestones. Use widgets for quick monitoring. Access tips for smarter spending. Manage multiple accounts efficiently. Review past transactions with search tools. PocketBudget makes money management simple and actionable.",
    "size": "48 MB",
    "reviews": 10120,
    "ratingAvg": 4.3,
    "downloads": "2.1M",
    "ratings": [
      {
        "name": "1 star",
        "count": 610
      },
      {
        "name": "2 star",
        "count": 820
      },
      {
        "name": "3 star",
        "count": 1360
      },
      {
        "name": "4 star",
        "count": 2940
      },
      {
        "name": "5 star",
        "count": 4390
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/5PM1qFw/machine-learning-7747348.png",
    "title": "EduQuest",
    "companyName": "BrightLearn",
    "id": 13,
    "description": "EduQuest provides interactive learning for students. Access courses across subjects. Track learning progress easily. Complete quizzes for assessment. Participate in interactive exercises. Explore video lessons and tutorials. Save notes for revision. Join discussion forums for collaboration. Receive feedback from educators. Customize learning paths to suit needs. Access offline study material. Monitor time spent on learning. Track achievements and badges. Set reminders for study sessions. Practice with flashcards and games. View performance analytics. Share learning milestones with peers. Discover trending educational content. Access expert tips and guides. EduQuest makes learning structured, engaging, and measurable.",
    "size": "70 MB",
    "reviews": 18200,
    "ratingAvg": 4.7,
    "downloads": "6.8M",
    "ratings": [
      {
        "name": "1 star",
        "count": 420
      },
      {
        "name": "2 star",
        "count": 580
      },
      {
        "name": "3 star",
        "count": 1620
      },
      {
        "name": "4 star",
        "count": 4420
      },
      {
        "name": "5 star",
        "count": 11160
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/j95L6wxh/season-11525992.png",
    "title": "WeatherNow",
    "companyName": "Skycast",
    "id": 14,
    "description": "WeatherNow provides accurate weather forecasts. Access hourly, daily, and weekly reports. Track temperature and precipitation. View wind speed and direction. Get severe weather alerts. Check air quality updates. Explore radar and satellite maps. Plan outdoor activities accordingly. Set location-specific forecasts. Receive sunrise and sunset times. Access weather news and trends. Compare forecasts from multiple sources. Monitor storm tracking and warnings. Use customizable widgets for quick access. Sync across multiple devices. Explore detailed climate statistics. Share weather updates with contacts. Save favorite locations. Adjust units and measurement preferences. WeatherNow makes planning and safety simple and reliable.",
    "size": "55 MB",
    "reviews": 23120,
    "ratingAvg": 4.4,
    "downloads": "7M",
    "ratings": [
      {
        "name": "1 star",
        "count": 1130
      },
      {
        "name": "2 star",
        "count": 1260
      },
      {
        "name": "3 star",
        "count": 2650
      },
      {
        "name": "4 star",
        "count": 6820
      },
      {
        "name": "5 star",
        "count": 11260
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/8gHq14wV/shopping-14656004.png",
    "title": "Shoply",
    "companyName": "Cartify",
    "id": 15,
    "description": "Shoply helps you shop smarter and save money. Compare prices across multiple stores instantly. Access curated deals and discounts daily. Track price drops for your favorite products. Save items to wishlists for future reference. Receive notifications for exclusive offers. Discover trending products in various categories. Use barcode scanning for quick product information. Add products to your cart seamlessly. Filter search results by price, rating, or brand. Read reviews from other users before purchasing. Track order history and delivery status. Access personalized recommendations based on your preferences. Share product links with friends and family. Create multiple shopping lists for occasions. Get tips on budgeting while shopping. Sync data across devices for convenience. Explore seasonal promotions and flash sales. Use secure payment options for peace of mind. Shoply makes online shopping easy, efficient, and enjoyable.",
    "size": "66 MB",
    "reviews": 19870,
    "ratingAvg": 4.2,
    "downloads": "54M",
    "ratings": [
      {
        "name": "1 star",
        "count": 1240
      },
      {
        "name": "2 star",
        "count": 1380
      },
      {
        "name": "3 star",
        "count": 2410
      },
      {
        "name": "4 star",
        "count": 5400
      },
      {
        "name": "5 star",
        "count": 9440
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TMMSt3sm/gamepad-6454949.png",
    "title": "GameHub",
    "companyName": "PixelForge",
    "id": 16,
    "description": "GameHub is your one-stop hub for gaming enthusiasts. Discover trending games across platforms. Track game updates and new releases. Read detailed game descriptions and reviews. Watch trailers and gameplay videos. Connect with friends and join multiplayer sessions. Explore gaming communities and forums. Access tips, guides, and walkthroughs. Save favorite games for quick access. Receive notifications for events and tournaments. Track achievements and leaderboards. Customize your profile to showcase progress. Participate in daily challenges and rewards. Share screenshots and clips with friends. Discover in-game news and patches instantly. Access game recommendations based on preferences. Use offline mode for game information anywhere. Compare game ratings and popularity easily. Sync progress across devices. GameHub keeps you updated, connected, and engaged with your favorite games.",
    "size": "92 MB",
    "reviews": 32300,
    "ratingAvg": 4.6,
    "downloads": "12M",
    "ratings": [
      {
        "name": "1 star",
        "count": 980
      },
      {
        "name": "2 star",
        "count": 1220
      },
      {
        "name": "3 star",
        "count": 3140
      },
      {
        "name": "4 star",
        "count": 7830
      },
      {
        "name": "5 star",
        "count": 19130
      }
    ]
  }
]